Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/isi.h
/**
 * \file
 *
 * \brief Component description for ISI
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

/* file generated from device description version 2018-11-06T08:21:24Z */
#ifndef _SAMV71_ISI_COMPONENT_H_
#define _SAMV71_ISI_COMPONENT_H_
#define _SAMV71_ISI_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAMV_SAMV71 Image Sensor Interface
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ISI */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define ISI_6350                       /**< (ISI) Module ID */
#define REV_ISI K                      /**< (ISI) Module revision */

/* -------- ISI_CFG1 : (ISI Offset: 0x00) (R/W 32) ISI Configuration 1 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :2;                        /**< bit:   0..1  Reserved */
    uint32_t HSYNC_POL:1;               /**< bit:      2  Horizontal Synchronization Polarity      */
    uint32_t VSYNC_POL:1;               /**< bit:      3  Vertical Synchronization Polarity        */
    uint32_t PIXCLK_POL:1;              /**< bit:      4  Pixel Clock Polarity                     */
    uint32_t GRAYLE:1;                  /**< bit:      5  Grayscale Little Endian                  */
    uint32_t EMB_SYNC:1;                /**< bit:      6  Embedded Synchronization                 */
    uint32_t CRC_SYNC:1;                /**< bit:      7  Embedded Synchronization Correction      */
    uint32_t FRATE:3;                   /**< bit:  8..10  Frame Rate [0..7]                        */
    uint32_t DISCR:1;                   /**< bit:     11  Disable Codec Request                    */
    uint32_t FULL:1;                    /**< bit:     12  Full Mode is Allowed                     */
    uint32_t THMASK:2;                  /**< bit: 13..14  Threshold Mask                           */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t SLD:8;                     /**< bit: 16..23  Start of Line Delay                      */
    uint32_t SFD:8;                     /**< bit: 24..31  Start of Frame Delay                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_CFG1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_CFG1_OFFSET                     (0x00)                                        /**<  (ISI_CFG1) ISI Configuration 1 Register  Offset */

#define ISI_CFG1_HSYNC_POL_Pos              2                                              /**< (ISI_CFG1) Horizontal Synchronization Polarity Position */
#define ISI_CFG1_HSYNC_POL_Msk              (_U_(0x1) << ISI_CFG1_HSYNC_POL_Pos)           /**< (ISI_CFG1) Horizontal Synchronization Polarity Mask */
#define ISI_CFG1_HSYNC_POL                  ISI_CFG1_HSYNC_POL_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_HSYNC_POL_Msk instead */
#define ISI_CFG1_VSYNC_POL_Pos              3                                              /**< (ISI_CFG1) Vertical Synchronization Polarity Position */
#define ISI_CFG1_VSYNC_POL_Msk              (_U_(0x1) << ISI_CFG1_VSYNC_POL_Pos)           /**< (ISI_CFG1) Vertical Synchronization Polarity Mask */
#define ISI_CFG1_VSYNC_POL                  ISI_CFG1_VSYNC_POL_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_VSYNC_POL_Msk instead */
#define ISI_CFG1_PIXCLK_POL_Pos             4                                              /**< (ISI_CFG1) Pixel Clock Polarity Position */
#define ISI_CFG1_PIXCLK_POL_Msk             (_U_(0x1) << ISI_CFG1_PIXCLK_POL_Pos)          /**< (ISI_CFG1) Pixel Clock Polarity Mask */
#define ISI_CFG1_PIXCLK_POL                 ISI_CFG1_PIXCLK_POL_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_PIXCLK_POL_Msk instead */
#define ISI_CFG1_GRAYLE_Pos                 5                                              /**< (ISI_CFG1) Grayscale Little Endian Position */
#define ISI_CFG1_GRAYLE_Msk                 (_U_(0x1) << ISI_CFG1_GRAYLE_Pos)              /**< (ISI_CFG1) Grayscale Little Endian Mask */
#define ISI_CFG1_GRAYLE                     ISI_CFG1_GRAYLE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_GRAYLE_Msk instead */
#define ISI_CFG1_EMB_SYNC_Pos               6                                              /**< (ISI_CFG1) Embedded Synchronization Position */
#define ISI_CFG1_EMB_SYNC_Msk               (_U_(0x1) << ISI_CFG1_EMB_SYNC_Pos)            /**< (ISI_CFG1) Embedded Synchronization Mask */
#define ISI_CFG1_EMB_SYNC                   ISI_CFG1_EMB_SYNC_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_EMB_SYNC_Msk instead */
#define ISI_CFG1_CRC_SYNC_Pos               7                                              /**< (ISI_CFG1) Embedded Synchronization Correction Position */
#define ISI_CFG1_CRC_SYNC_Msk               (_U_(0x1) << ISI_CFG1_CRC_SYNC_Pos)            /**< (ISI_CFG1) Embedded Synchronization Correction Mask */
#define ISI_CFG1_CRC_SYNC                   ISI_CFG1_CRC_SYNC_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_CRC_SYNC_Msk instead */
#define ISI_CFG1_FRATE_Pos                  8                                              /**< (ISI_CFG1) Frame Rate [0..7] Position */
#define ISI_CFG1_FRATE_Msk                  (_U_(0x7) << ISI_CFG1_FRATE_Pos)               /**< (ISI_CFG1) Frame Rate [0..7] Mask */
#define ISI_CFG1_FRATE(value)               (ISI_CFG1_FRATE_Msk & ((value) << ISI_CFG1_FRATE_Pos))
#define ISI_CFG1_DISCR_Pos                  11                                             /**< (ISI_CFG1) Disable Codec Request Position */
#define ISI_CFG1_DISCR_Msk                  (_U_(0x1) << ISI_CFG1_DISCR_Pos)               /**< (ISI_CFG1) Disable Codec Request Mask */
#define ISI_CFG1_DISCR                      ISI_CFG1_DISCR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_DISCR_Msk instead */
#define ISI_CFG1_FULL_Pos                   12                                             /**< (ISI_CFG1) Full Mode is Allowed Position */
#define ISI_CFG1_FULL_Msk                   (_U_(0x1) << ISI_CFG1_FULL_Pos)                /**< (ISI_CFG1) Full Mode is Allowed Mask */
#define ISI_CFG1_FULL                       ISI_CFG1_FULL_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG1_FULL_Msk instead */
#define ISI_CFG1_THMASK_Pos                 13                                             /**< (ISI_CFG1) Threshold Mask Position */
#define ISI_CFG1_THMASK_Msk                 (_U_(0x3) << ISI_CFG1_THMASK_Pos)              /**< (ISI_CFG1) Threshold Mask Mask */
#define ISI_CFG1_THMASK(value)              (ISI_CFG1_THMASK_Msk & ((value) << ISI_CFG1_THMASK_Pos))
#define   ISI_CFG1_THMASK_BEATS_4_Val       _U_(0x0)                                       /**< (ISI_CFG1) Only 4 beats AHB burst allowed  */
#define   ISI_CFG1_THMASK_BEATS_8_Val       _U_(0x1)                                       /**< (ISI_CFG1) Only 4 and 8 beats AHB burst allowed  */
#define   ISI_CFG1_THMASK_BEATS_16_Val      _U_(0x2)                                       /**< (ISI_CFG1) 4, 8 and 16 beats AHB burst allowed  */
#define ISI_CFG1_THMASK_BEATS_4             (ISI_CFG1_THMASK_BEATS_4_Val << ISI_CFG1_THMASK_Pos)  /**< (ISI_CFG1) Only 4 beats AHB burst allowed Position  */
#define ISI_CFG1_THMASK_BEATS_8             (ISI_CFG1_THMASK_BEATS_8_Val << ISI_CFG1_THMASK_Pos)  /**< (ISI_CFG1) Only 4 and 8 beats AHB burst allowed Position  */
#define ISI_CFG1_THMASK_BEATS_16            (ISI_CFG1_THMASK_BEATS_16_Val << ISI_CFG1_THMASK_Pos)  /**< (ISI_CFG1) 4, 8 and 16 beats AHB burst allowed Position  */
#define ISI_CFG1_SLD_Pos                    16                                             /**< (ISI_CFG1) Start of Line Delay Position */
#define ISI_CFG1_SLD_Msk                    (_U_(0xFF) << ISI_CFG1_SLD_Pos)                /**< (ISI_CFG1) Start of Line Delay Mask */
#define ISI_CFG1_SLD(value)                 (ISI_CFG1_SLD_Msk & ((value) << ISI_CFG1_SLD_Pos))
#define ISI_CFG1_SFD_Pos                    24                                             /**< (ISI_CFG1) Start of Frame Delay Position */
#define ISI_CFG1_SFD_Msk                    (_U_(0xFF) << ISI_CFG1_SFD_Pos)                /**< (ISI_CFG1) Start of Frame Delay Mask */
#define ISI_CFG1_SFD(value)                 (ISI_CFG1_SFD_Msk & ((value) << ISI_CFG1_SFD_Pos))
#define ISI_CFG1_Msk                        _U_(0xFFFF7FFC)                                /**< (ISI_CFG1) Register Mask  */


/* -------- ISI_CFG2 : (ISI Offset: 0x04) (R/W 32) ISI Configuration 2 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t IM_VSIZE:11;               /**< bit:  0..10  Vertical Size of the Image Sensor [0..2047] */
    uint32_t GS_MODE:1;                 /**< bit:     11  Grayscale Pixel Format Mode              */
    uint32_t RGB_MODE:1;                /**< bit:     12  RGB Input Mode                           */
    uint32_t GRAYSCALE:1;               /**< bit:     13  Grayscale Mode Format Enable             */
    uint32_t RGB_SWAP:1;                /**< bit:     14  RGB Format Swap Mode                     */
    uint32_t COL_SPACE:1;               /**< bit:     15  Color Space for the Image Data           */
    uint32_t IM_HSIZE:11;               /**< bit: 16..26  Horizontal Size of the Image Sensor [0..2047] */
    uint32_t :1;                        /**< bit:     27  Reserved */
    uint32_t YCC_SWAP:2;                /**< bit: 28..29  YCrCb Format Swap Mode                   */
    uint32_t RGB_CFG:2;                 /**< bit: 30..31  RGB Pixel Mapping Configuration          */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_CFG2_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_CFG2_OFFSET                     (0x04)                                        /**<  (ISI_CFG2) ISI Configuration 2 Register  Offset */

#define ISI_CFG2_IM_VSIZE_Pos               0                                              /**< (ISI_CFG2) Vertical Size of the Image Sensor [0..2047] Position */
#define ISI_CFG2_IM_VSIZE_Msk               (_U_(0x7FF) << ISI_CFG2_IM_VSIZE_Pos)          /**< (ISI_CFG2) Vertical Size of the Image Sensor [0..2047] Mask */
#define ISI_CFG2_IM_VSIZE(value)            (ISI_CFG2_IM_VSIZE_Msk & ((value) << ISI_CFG2_IM_VSIZE_Pos))
#define ISI_CFG2_GS_MODE_Pos                11                                             /**< (ISI_CFG2) Grayscale Pixel Format Mode Position */
#define ISI_CFG2_GS_MODE_Msk                (_U_(0x1) << ISI_CFG2_GS_MODE_Pos)             /**< (ISI_CFG2) Grayscale Pixel Format Mode Mask */
#define ISI_CFG2_GS_MODE                    ISI_CFG2_GS_MODE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG2_GS_MODE_Msk instead */
#define ISI_CFG2_RGB_MODE_Pos               12                                             /**< (ISI_CFG2) RGB Input Mode Position */
#define ISI_CFG2_RGB_MODE_Msk               (_U_(0x1) << ISI_CFG2_RGB_MODE_Pos)            /**< (ISI_CFG2) RGB Input Mode Mask */
#define ISI_CFG2_RGB_MODE                   ISI_CFG2_RGB_MODE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG2_RGB_MODE_Msk instead */
#define ISI_CFG2_GRAYSCALE_Pos              13                                             /**< (ISI_CFG2) Grayscale Mode Format Enable Position */
#define ISI_CFG2_GRAYSCALE_Msk              (_U_(0x1) << ISI_CFG2_GRAYSCALE_Pos)           /**< (ISI_CFG2) Grayscale Mode Format Enable Mask */
#define ISI_CFG2_GRAYSCALE                  ISI_CFG2_GRAYSCALE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG2_GRAYSCALE_Msk instead */
#define ISI_CFG2_RGB_SWAP_Pos               14                                             /**< (ISI_CFG2) RGB Format Swap Mode Position */
#define ISI_CFG2_RGB_SWAP_Msk               (_U_(0x1) << ISI_CFG2_RGB_SWAP_Pos)            /**< (ISI_CFG2) RGB Format Swap Mode Mask */
#define ISI_CFG2_RGB_SWAP                   ISI_CFG2_RGB_SWAP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG2_RGB_SWAP_Msk instead */
#define ISI_CFG2_COL_SPACE_Pos              15                                             /**< (ISI_CFG2) Color Space for the Image Data Position */
#define ISI_CFG2_COL_SPACE_Msk              (_U_(0x1) << ISI_CFG2_COL_SPACE_Pos)           /**< (ISI_CFG2) Color Space for the Image Data Mask */
#define ISI_CFG2_COL_SPACE                  ISI_CFG2_COL_SPACE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CFG2_COL_SPACE_Msk instead */
#define ISI_CFG2_IM_HSIZE_Pos               16                                             /**< (ISI_CFG2) Horizontal Size of the Image Sensor [0..2047] Position */
#define ISI_CFG2_IM_HSIZE_Msk               (_U_(0x7FF) << ISI_CFG2_IM_HSIZE_Pos)          /**< (ISI_CFG2) Horizontal Size of the Image Sensor [0..2047] Mask */
#define ISI_CFG2_IM_HSIZE(value)            (ISI_CFG2_IM_HSIZE_Msk & ((value) << ISI_CFG2_IM_HSIZE_Pos))
#define ISI_CFG2_YCC_SWAP_Pos               28                                             /**< (ISI_CFG2) YCrCb Format Swap Mode Position */
#define ISI_CFG2_YCC_SWAP_Msk               (_U_(0x3) << ISI_CFG2_YCC_SWAP_Pos)            /**< (ISI_CFG2) YCrCb Format Swap Mode Mask */
#define ISI_CFG2_YCC_SWAP(value)            (ISI_CFG2_YCC_SWAP_Msk & ((value) << ISI_CFG2_YCC_SWAP_Pos))
#define   ISI_CFG2_YCC_SWAP_DEFAULT_Val     _U_(0x0)                                       /**< (ISI_CFG2) Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1)  */
#define   ISI_CFG2_YCC_SWAP_MODE1_Val       _U_(0x1)                                       /**< (ISI_CFG2) Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1)  */
#define   ISI_CFG2_YCC_SWAP_MODE2_Val       _U_(0x2)                                       /**< (ISI_CFG2) Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i)  */
#define   ISI_CFG2_YCC_SWAP_MODE3_Val       _U_(0x3)                                       /**< (ISI_CFG2) Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i)  */
#define ISI_CFG2_YCC_SWAP_DEFAULT           (ISI_CFG2_YCC_SWAP_DEFAULT_Val << ISI_CFG2_YCC_SWAP_Pos)  /**< (ISI_CFG2) Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1) Position  */
#define ISI_CFG2_YCC_SWAP_MODE1             (ISI_CFG2_YCC_SWAP_MODE1_Val << ISI_CFG2_YCC_SWAP_Pos)  /**< (ISI_CFG2) Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1) Position  */
#define ISI_CFG2_YCC_SWAP_MODE2             (ISI_CFG2_YCC_SWAP_MODE2_Val << ISI_CFG2_YCC_SWAP_Pos)  /**< (ISI_CFG2) Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i) Position  */
#define ISI_CFG2_YCC_SWAP_MODE3             (ISI_CFG2_YCC_SWAP_MODE3_Val << ISI_CFG2_YCC_SWAP_Pos)  /**< (ISI_CFG2) Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i) Position  */
#define ISI_CFG2_RGB_CFG_Pos                30                                             /**< (ISI_CFG2) RGB Pixel Mapping Configuration Position */
#define ISI_CFG2_RGB_CFG_Msk                (_U_(0x3) << ISI_CFG2_RGB_CFG_Pos)             /**< (ISI_CFG2) RGB Pixel Mapping Configuration Mask */
#define ISI_CFG2_RGB_CFG(value)             (ISI_CFG2_RGB_CFG_Msk & ((value) << ISI_CFG2_RGB_CFG_Pos))
#define   ISI_CFG2_RGB_CFG_DEFAULT_Val      _U_(0x0)                                       /**< (ISI_CFG2) Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B  */
#define   ISI_CFG2_RGB_CFG_MODE1_Val        _U_(0x1)                                       /**< (ISI_CFG2) Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R  */
#define   ISI_CFG2_RGB_CFG_MODE2_Val        _U_(0x2)                                       /**< (ISI_CFG2) Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB)  */
#define   ISI_CFG2_RGB_CFG_MODE3_Val        _U_(0x3)                                       /**< (ISI_CFG2) Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB)  */
#define ISI_CFG2_RGB_CFG_DEFAULT            (ISI_CFG2_RGB_CFG_DEFAULT_Val << ISI_CFG2_RGB_CFG_Pos)  /**< (ISI_CFG2) Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B Position  */
#define ISI_CFG2_RGB_CFG_MODE1              (ISI_CFG2_RGB_CFG_MODE1_Val << ISI_CFG2_RGB_CFG_Pos)  /**< (ISI_CFG2) Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R Position  */
#define ISI_CFG2_RGB_CFG_MODE2              (ISI_CFG2_RGB_CFG_MODE2_Val << ISI_CFG2_RGB_CFG_Pos)  /**< (ISI_CFG2) Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB) Position  */
#define ISI_CFG2_RGB_CFG_MODE3              (ISI_CFG2_RGB_CFG_MODE3_Val << ISI_CFG2_RGB_CFG_Pos)  /**< (ISI_CFG2) Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB) Position  */
#define ISI_CFG2_MASK                       _U_(0xF7FFFFFF)                                /**< \deprecated (ISI_CFG2) Register MASK  (Use ISI_CFG2_Msk instead)  */
#define ISI_CFG2_Msk                        _U_(0xF7FFFFFF)                                /**< (ISI_CFG2) Register Mask  */


/* -------- ISI_PSIZE : (ISI Offset: 0x08) (R/W 32) ISI Preview Size Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t PREV_VSIZE:10;             /**< bit:   0..9  Vertical Size for the Preview Path       */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t PREV_HSIZE:10;             /**< bit: 16..25  Horizontal Size for the Preview Path     */
    uint32_t :6;                        /**< bit: 26..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_PSIZE_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_PSIZE_OFFSET                    (0x08)                                        /**<  (ISI_PSIZE) ISI Preview Size Register  Offset */

#define ISI_PSIZE_PREV_VSIZE_Pos            0                                              /**< (ISI_PSIZE) Vertical Size for the Preview Path Position */
#define ISI_PSIZE_PREV_VSIZE_Msk            (_U_(0x3FF) << ISI_PSIZE_PREV_VSIZE_Pos)       /**< (ISI_PSIZE) Vertical Size for the Preview Path Mask */
#define ISI_PSIZE_PREV_VSIZE(value)         (ISI_PSIZE_PREV_VSIZE_Msk & ((value) << ISI_PSIZE_PREV_VSIZE_Pos))
#define ISI_PSIZE_PREV_HSIZE_Pos            16                                             /**< (ISI_PSIZE) Horizontal Size for the Preview Path Position */
#define ISI_PSIZE_PREV_HSIZE_Msk            (_U_(0x3FF) << ISI_PSIZE_PREV_HSIZE_Pos)       /**< (ISI_PSIZE) Horizontal Size for the Preview Path Mask */
#define ISI_PSIZE_PREV_HSIZE(value)         (ISI_PSIZE_PREV_HSIZE_Msk & ((value) << ISI_PSIZE_PREV_HSIZE_Pos))
#define ISI_PSIZE_MASK                      _U_(0x3FF03FF)                                 /**< \deprecated (ISI_PSIZE) Register MASK  (Use ISI_PSIZE_Msk instead)  */
#define ISI_PSIZE_Msk                       _U_(0x3FF03FF)                                 /**< (ISI_PSIZE) Register Mask  */


/* -------- ISI_PDECF : (ISI Offset: 0x0c) (R/W 32) ISI Preview Decimation Factor Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t DEC_FACTOR:8;              /**< bit:   0..7  Decimation Factor                        */
    uint32_t :24;                       /**< bit:  8..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_PDECF_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_PDECF_OFFSET                    (0x0C)                                        /**<  (ISI_PDECF) ISI Preview Decimation Factor Register  Offset */

#define ISI_PDECF_DEC_FACTOR_Pos            0                                              /**< (ISI_PDECF) Decimation Factor Position */
#define ISI_PDECF_DEC_FACTOR_Msk            (_U_(0xFF) << ISI_PDECF_DEC_FACTOR_Pos)        /**< (ISI_PDECF) Decimation Factor Mask */
#define ISI_PDECF_DEC_FACTOR(value)         (ISI_PDECF_DEC_FACTOR_Msk & ((value) << ISI_PDECF_DEC_FACTOR_Pos))
#define ISI_PDECF_MASK                      _U_(0xFF)                                      /**< \deprecated (ISI_PDECF) Register MASK  (Use ISI_PDECF_Msk instead)  */
#define ISI_PDECF_Msk                       _U_(0xFF)                                      /**< (ISI_PDECF) Register Mask  */


