Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/isi.h
#define ISI_R2Y_SET0_C0_Pos                 0                                              /**< (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C0 Position */
#define ISI_R2Y_SET0_C0_Msk                 (_U_(0x7F) << ISI_R2Y_SET0_C0_Pos)             /**< (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C0 Mask */
#define ISI_R2Y_SET0_C0(value)              (ISI_R2Y_SET0_C0_Msk & ((value) << ISI_R2Y_SET0_C0_Pos))
#define ISI_R2Y_SET0_C1_Pos                 8                                              /**< (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C1 Position */
#define ISI_R2Y_SET0_C1_Msk                 (_U_(0x7F) << ISI_R2Y_SET0_C1_Pos)             /**< (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C1 Mask */
#define ISI_R2Y_SET0_C1(value)              (ISI_R2Y_SET0_C1_Msk & ((value) << ISI_R2Y_SET0_C1_Pos))
#define ISI_R2Y_SET0_C2_Pos                 16                                             /**< (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C2 Position */
#define ISI_R2Y_SET0_C2_Msk                 (_U_(0x7F) << ISI_R2Y_SET0_C2_Pos)             /**< (ISI_R2Y_SET0) Color Space Conversion Matrix Coefficient C2 Mask */
#define ISI_R2Y_SET0_C2(value)              (ISI_R2Y_SET0_C2_Msk & ((value) << ISI_R2Y_SET0_C2_Pos))
#define ISI_R2Y_SET0_Roff_Pos               24                                             /**< (ISI_R2Y_SET0) Color Space Conversion Red Component Offset Position */
#define ISI_R2Y_SET0_Roff_Msk               (_U_(0x1) << ISI_R2Y_SET0_Roff_Pos)            /**< (ISI_R2Y_SET0) Color Space Conversion Red Component Offset Mask */
#define ISI_R2Y_SET0_Roff                   ISI_R2Y_SET0_Roff_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_R2Y_SET0_Roff_Msk instead */
#define ISI_R2Y_SET0_MASK                   _U_(0x17F7F7F)                                 /**< \deprecated (ISI_R2Y_SET0) Register MASK  (Use ISI_R2Y_SET0_Msk instead)  */
#define ISI_R2Y_SET0_Msk                    _U_(0x17F7F7F)                                 /**< (ISI_R2Y_SET0) Register Mask  */


/* -------- ISI_R2Y_SET1 : (ISI Offset: 0x1c) (R/W 32) ISI Color Space Conversion RGB To YCrCb Set 1 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t C3:7;                      /**< bit:   0..6  Color Space Conversion Matrix Coefficient C3 */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t C4:7;                      /**< bit:  8..14  Color Space Conversion Matrix Coefficient C4 */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t C5:7;                      /**< bit: 16..22  Color Space Conversion Matrix Coefficient C5 */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t Goff:1;                    /**< bit:     24  Color Space Conversion Green Component Offset */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_R2Y_SET1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_R2Y_SET1_OFFSET                 (0x1C)                                        /**<  (ISI_R2Y_SET1) ISI Color Space Conversion RGB To YCrCb Set 1 Register  Offset */

#define ISI_R2Y_SET1_C3_Pos                 0                                              /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C3 Position */
#define ISI_R2Y_SET1_C3_Msk                 (_U_(0x7F) << ISI_R2Y_SET1_C3_Pos)             /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C3 Mask */
#define ISI_R2Y_SET1_C3(value)              (ISI_R2Y_SET1_C3_Msk & ((value) << ISI_R2Y_SET1_C3_Pos))
#define ISI_R2Y_SET1_C4_Pos                 8                                              /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C4 Position */
#define ISI_R2Y_SET1_C4_Msk                 (_U_(0x7F) << ISI_R2Y_SET1_C4_Pos)             /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C4 Mask */
#define ISI_R2Y_SET1_C4(value)              (ISI_R2Y_SET1_C4_Msk & ((value) << ISI_R2Y_SET1_C4_Pos))
#define ISI_R2Y_SET1_C5_Pos                 16                                             /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C5 Position */
#define ISI_R2Y_SET1_C5_Msk                 (_U_(0x7F) << ISI_R2Y_SET1_C5_Pos)             /**< (ISI_R2Y_SET1) Color Space Conversion Matrix Coefficient C5 Mask */
#define ISI_R2Y_SET1_C5(value)              (ISI_R2Y_SET1_C5_Msk & ((value) << ISI_R2Y_SET1_C5_Pos))
#define ISI_R2Y_SET1_Goff_Pos               24                                             /**< (ISI_R2Y_SET1) Color Space Conversion Green Component Offset Position */
#define ISI_R2Y_SET1_Goff_Msk               (_U_(0x1) << ISI_R2Y_SET1_Goff_Pos)            /**< (ISI_R2Y_SET1) Color Space Conversion Green Component Offset Mask */
#define ISI_R2Y_SET1_Goff                   ISI_R2Y_SET1_Goff_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_R2Y_SET1_Goff_Msk instead */
#define ISI_R2Y_SET1_MASK                   _U_(0x17F7F7F)                                 /**< \deprecated (ISI_R2Y_SET1) Register MASK  (Use ISI_R2Y_SET1_Msk instead)  */
#define ISI_R2Y_SET1_Msk                    _U_(0x17F7F7F)                                 /**< (ISI_R2Y_SET1) Register Mask  */


/* -------- ISI_R2Y_SET2 : (ISI Offset: 0x20) (R/W 32) ISI Color Space Conversion RGB To YCrCb Set 2 Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t C6:7;                      /**< bit:   0..6  Color Space Conversion Matrix Coefficient C6 */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t C7:7;                      /**< bit:  8..14  Color Space Conversion Matrix Coefficient C7 */
    uint32_t :1;                        /**< bit:     15  Reserved */
    uint32_t C8:7;                      /**< bit: 16..22  Color Space Conversion Matrix Coefficient C8 */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t Boff:1;                    /**< bit:     24  Color Space Conversion Blue Component Offset */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_R2Y_SET2_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

